DataProcessors/ОтправитьВМосквуРасходныеНакладные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОтправитьВМосквуРасходныеНакладные</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НастройкаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НастройкиОбменаСПорталом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПочтыВМоскве</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКаталогаФайлаДляМосквы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратПоставщику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПКО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РКО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратыПокупателей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инвентаризация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректировкаРеализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступлениеТоваров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОтправки</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Списание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оприходование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПересортицаТоваров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребованиеНакладная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвансовыйОтчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступлениеТоваровНеМоскворечье</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтрагентыВключить</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/бит_ОперацияОбменаСПорталом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ОперацияОбменаСПорталом</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаФайлов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработкаЗагруженныхФайлов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаФайлов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированияФайловВыгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановкаСоединения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/НазваниеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>НазваниеБазы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Альметьевск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Владимир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воронеж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воронеж2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Восток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Казань</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Казань2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Калуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Киров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Краснодар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Краснодар2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Липецк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Молодогвардейская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НабережныеЧелны</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НижнийНовгород</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пенза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пятигорск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ростов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ростов2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рязань</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Самара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Саранск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Север</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тамбов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тверь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тула</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ульяновск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Чебоксары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шахты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮГ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ярославль</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийПКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПКО</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПокупателя</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходДенежныхСредствРозничнаяВыручка</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПодотчетником</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеНаличныхДенежныхСредствВБанке</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймамСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходДенежныхСредствПрочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийРКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРКО</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПокупателю</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймамСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредствПодотчетнику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредствКассеККМ</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаличнымиВБанк</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходДенежныхСредствПрочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПересортицаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПересортицаТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СписанныеТовары</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриходоватьТоварыПоСебестоимостиСписания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураОприходование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияОприходование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ОтправитьВМосквуРасходныеНакладные/Ext/ObjectModule.bsl
Перем ФормаОбработки Экспорт;
Перем Соединение Экспорт;

Функция ВыполнитьОбмен(Текст,НачПериода,КонПериода) Экспорт
	
	Перем ИмяFTPСервера, ИмяКаталогаСервера;
	
	ЗагруженоЗаказов = 0;
	ВыгруженоЗаказов = 0;
	
	//Подключение к ftp
	ДатаОбмена = ТекущаяДата();
	ИДТекущегоОбмена = Новый УникальныйИдентификатор();
	НомерСообщенияПротокола = 0;
	НомерФайла = 0;
	ПроверитьНастройкиПодключения = УстановитьСоединениеСFTP(ИмяFTPСервера, ИмяКаталогаСервера);
	
	Если Не ПроверитьНастройкиПодключения Тогда
		Возврат "Ошибка проверки настройки FTP";
	КонецЕсли; 
	
	Текст.Записать(КаталогВременныхФайлов() + "PKO.txt", КодировкаТекста.ANSI);  //PKO
	ЗаголовокФайла = "ПродажиИДеньгиСамарыЗаПериод";
	
	Соединение.Записать(КаталогВременныхФайлов() + "PKO.txt", ИмяКаталогаСервера + "/" + СокрЛП(ИмяКаталогаФайлаДляМосквы) + "/PKO.txt"); 
	
	Возврат "Файл для Москвы выложен на FTP!";
	
КонецФункции

Функция УстановитьСоединениеСFTP(ИмяFTPСервера,ИмяКаталогаСервера) Экспорт
	
	ИмяКаталогаСервера = "";
	ИмяFTPСервера = "";
	
	// нужно по полному имени получить имя сервера и имя каталога
	ПолучитьИмяСервераИИмяКаталогаОбмена(НастройкаОбмена.FTPАдресОбмена, ИмяFTPСервера, ИмяКаталогаСервера);
	
	// если не задано имя сервера или каталога то невозможно обмениваться данными
	Если ПустаяСтрока(ИмяFTPСервера) Тогда
		
		ОписаниеОшибки = "Не задан сервер обмена информацией через FTP.";
		СоздатьЗаписьПротокола(ОписаниеОшибки, Перечисления.бит_ОперацияОбменаСПорталом.УстановкаСоединения);
		Возврат Ложь;
		
	КонецЕсли;
	
	// соединение
	Соединение = ВыполнитьFTPПодключениеКСерверу(ИмяFTPСервера, НастройкаОбмена);
	
	Если Соединение = Неопределено Тогда
		
		Сообщить("Не установлено соединение по протоколу FTP", СтатусСообщения.ОченьВажное);
		Возврат Ложь;
		
	КонецЕсли;
	
	// каталог проверяем
	НаличиеКаталога = ПроверитьНаличиеКаталогаНаFTPСервере(Соединение, ИмяКаталогаСервера);
	
	Если Не НаличиеКаталога Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	// Проверим подкаталог out
	НаличиеКаталога = ПроверитьНаличиеКаталогаНаFTPСервере(Соединение, ИмяКаталогаСервера + "/" + СокрЛП(ИмяКаталогаФайлаДляМосквы) + "/");
	
	Если Не НаличиеКаталога Тогда 
		
		Сообщить("Не найден каталог обмена с Москвой по имени " + ИмяКаталогаФайлаДляМосквы, СтатусСообщения.ОченьВажное);
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ПолучитьИмяСервераИИмяКаталогаОбмена(Знач ПолныйFTPАдрес, ИмяСервера, ИмяКаталога) Экспорт
	
	АдресОбмена = НормализоватьFTPАдрес(ПолныйFTPАдрес);
	
	// принцип получения адреса такой, все что до первой черты / или \ - это имя сервера, потом каталог
	АдресОбмена = СтрЗаменить(АдресОбмена, "\", "/");
	
	ПозицияПрямогоСлеша = Найти(АдресОбмена, "/");
	
	Если ПозицияПрямогоСлеша = 0 Тогда
		
		ИмяСервера = АдресОбмена;
		ИмяКаталога = "";
		
	Иначе
		
		ИмяСервера = Сред(АдресОбмена, 1, ПозицияПрямогоСлеша - 1);
		ИмяКаталога = Сред(АдресОбмена, ПозицияПрямогоСлеша);
		
		// последний должен быть слеш у имени каталога
		Если Сред(ИмяКаталога, СтрДлина(ИмяКаталога)) <> "/" Тогда
			ИмяКаталога = ИмяКаталога + "/";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьЗаписьПротокола(Описание, ОперацияОбменаСПорталом,ЭтоОшибка = Истина) Экспорт
	
	Если ЗначениеЗаполнено(Описание) Тогда
		
		Если ФормаОбработки <> Неопределено Тогда
			ФормаОбработки.ЭлементыФормы.ПолеПротокола.ДобавитьСтроку(Строка(ОперацияОбменаСПорталом) + ": " + Описание);
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

Функция ВыполнитьFTPПодключениеКСерверу(Знач ИмяFTPСервера, НастройкиОбмена)       
	
	#Если Клиент Тогда
		Состояние("Выполняется подключение к FTP: " + ИмяFTPСервера);
		СоздатьЗаписьПротокола("Выполняется подключение к FTP: " + ИмяFTPСервера, Перечисления.бит_ОперацияОбменаСПорталом.УстановкаСоединения, Ложь);
	#КонецЕсли
	
	Попытка
		
		Соединение = Новый FTPСоединение(ИмяFTPСервера, НастройкиОбмена.ПортFTPСоединения, 
		НастройкиОбмена.ПользовательFTPСоединения, НастройкиОбмена.ПарольFTPСоединения, , НастройкиОбмена.ПассивноеFTPСоединение);						
		
	Исключение
		
		// ошибка при подключении к ftp
		СоздатьЗаписьПротокола("Ошибка при подключении к FTP : " + ИмяFTPСервера + " ! " + ОписаниеОшибки(), Перечисления.бит_ОперацияОбменаСПорталом.УстановкаСоединения);
		Возврат Неопределено;
		
	КонецПопытки;
	
	СоздатьЗаписьПротокола("Соединение установлено: " + ИмяFTPСервера, Перечисления.бит_ОперацияОбменаСПорталом.УстановкаСоединения, Ложь);
	
	Возврат Соединение;
	
КонецФункции

Функция ПроверитьНаличиеКаталогаНаFTPСервере(Соединение, Знач ИмяКаталогаСервера)
	
	Если ПустаяСтрока(ИмяКаталогаСервера) Тогда
		Возврат Истина;
	КонецЕсли;
	
	//надо сначала проверить что сам каталог доступа есть
	Попытка
		МассивНайденныхКаталогов = Соединение.НайтиФайлы(ИмяКаталогаСервера, "");
	Исключение
		
		// ошибка при подключении к ftp
		СоздатьЗаписьПротокола("Ошибка при соединении с FTP : " + ИмяКаталогаСервера + " ! " + ОписаниеОшибки(), Перечисления.бит_ОперацияОбменаСПорталом.УстановкаСоединения);
		Возврат Ложь;
		
	КонецПопытки;
	
	Для Каждого НайденныйКаталог Из МассивНайденныхКаталогов Цикл
		
		// если не каталог - то дальше ищем
		Если НЕ НайденныйКаталог.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		
		// большие и маленькие буквы считаются различными
		Если НайденныйКаталог.ПолноеИмя + "/" <> ИмяКаталогаСервера Тогда
			Продолжить;
		КонецЕсли;
		
		Возврат Истина;
		
	КонецЦикла;
	
	// если не найден каталог для обмена
	СоздатьЗаписьПротокола("Не найден FTP каталог обмена информацией: " + ИмяКаталогаСервера, Перечисления.бит_ОперацияОбменаСПорталом.УстановкаСоединения);
	
	Возврат Ложь;
	
КонецФункции

Функция НормализоватьFTPАдрес(Знач FTPАдрес) Экспорт
	
	ИтоговыйАдрес = СокрЛП(FTPАдрес);
	ПозицияFTP = Найти(Врег(ИтоговыйАдрес), "FTP://");
	
	Если ПозицияFTP = 1 Тогда
		ИтоговыйАдрес = Сред(ИтоговыйАдрес, 7);	
	КонецЕсли;
	
	Возврат ИтоговыйАдрес;
	
КонецФункции

Функция ВыполнитьОтправку()Экспорт 
	
	РезультатРаботы = "";
	
	#Если Клиент Тогда
		
		Если Не ЗначениеЗаполнено(НастройкаОбмена) И ТипОтправки = "FTP" Тогда 
			Предупреждение("Задайте настройку обмена", 20);
			Возврат "";
		КонецЕсли;
		
		Если  ТипОтправки = "ПоПочте" И ПустаяСтрока(АдресПочтыВМоскве) Тогда
			Предупреждение("Задайте адрес электронной почты ", 20);
			Возврат "";
		КонецЕсли;
		
		Если НачПериода = Дата(1,1,1) Тогда
			Предупреждение("Задайте начало периода", 20);
			Возврат "";
		КонецЕсли;
		
		Если КонПериода = Дата(1,1,1) Тогда
			Предупреждение("Задайте конец периода", 20);
			Возврат "";
		КонецЕсли;
		
	#КонецЕсли
	
	Текст = Новый ТекстовыйДокумент;    
	мБаза = Константы.База.Получить();   
	ПериодСтр = Формат(НачПериода, "ДЛФ=D") + "@" +  Формат(КонПериода, "ДЛФ=D") + "@";
	
	Если мБаза = Перечисления.НазваниеБазы.Самара Тогда 	
		Текст.ДобавитьСтроку(ПериодСтр + "1");
	ИначеЕсли мБаза = Перечисления.НазваниеБазы.Владимир Тогда 
		Текст.ДобавитьСтроку(ПериодСтр + "2");
	ИначеЕсли мБаза = Перечисления.НазваниеБазы.Рязань Тогда 
		Текст.ДобавитьСтроку(ПериодСтр + "3");		
	ИначеЕсли мБаза = Перечисления.НазваниеБазы.Тула Тогда 
		Текст.ДобавитьСтроку(ПериодСтр + "4");			
	ИначеЕсли мБаза = Перечисления.НазваниеБазы.Ярославль Тогда 
		Текст.ДобавитьСтроку(ПериодСтр + "5");			
	КонецЕсли;
	
	// ВНИМАНИЕ! "1" на конце в Москве будет означать, что этот файл из Самары...
	
	ДатаН = НачалоДня(НачПериода);
	ДатаК = КонецДня(КонПериода);
	МассивКонтрагентов = КонтрагентыВключить.ВыгрузитьКолонку("Контрагент");
	
	// РАСХОДНЫЕ НАКЛАДНЫЕ
	Если РН Тогда
		
		Запрос  = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК ДокументРН,
		|	РеализацияТоваровУслуг.Дата,
		|	РеализацияТоваровУслуг.ДоговорКонтрагента.Код,
		|	РеализацияТоваровУслуг.Номер КАК НомерРН,
		|	РеализацияТоваровУслуг.ДоговорКонтрагента.Наименование,
		|	РеализацияТоваровУслуг.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	СчетФактураВыданный.Ссылка КАК ДокументСФВыданный,
		|	СчетФактураВыданный.Номер КАК НомерСФ,
		|	РеализацияТоваровУслуг.Контрагент,
		|	СчетФактураВыданный.Дата КАК ДатаСФ
		|ПОМЕСТИТЬ ДокРН
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО СчетФактураВыданный.ДокументОснование = РеализацияТоваровУслуг.Ссылка
		|ГДЕ
		|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаН И &ДатаК
		|	И РеализацияТоваровУслуг.Проведен
		|	И РеализацияТоваровУслуг.Контрагент В(&СписокКонтрагентов)
		|	И СчетФактураВыданный.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокРН.ДокументРН КАК ДокументРН,
		|	ДокРН.Дата,
		|	ДокРН.НомерРН,
		|	ДокРН.Контрагент,
		|	ДокРН.ДоговорКонтрагентаКод,
		|	ДокРН.ДоговорКонтрагентаНаименование,
		|	ДокРН.СуммаВключаетНДС,
		|	ДокРНТовары.Номенклатура.КодПоБазеМоскоречье КАК НоменклатураКодПоБазеМоскоречье,
		|	ДокРНТовары.СерияНоменклатуры.Наименование КАК СерияНоменклатурыНаименование,
		|	ДокРНТовары.Количество,
		|	ДокРНТовары.Цена,
		|	ДокРНТовары.Сумма,
		|	ДокРНТовары.СуммаНДС,
		|	ДокРНТовары.НомерСтроки КАК НомерСтроки,
		|	ДокРН.ДокументСФВыданный,
		|	ДокРН.НомерСФ,
		|	ДокРН.ДатаСФ
		|ИЗ
		|	ДокРН КАК ДокРН
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК ДокРНТовары
		|		ПО ДокРН.ДокументРН = ДокРНТовары.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументРН,
		|	НомерСтроки
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("ДатаН", ДатаН);
		Запрос.УстановитьПараметр("ДатаК", ДатаК);
		
		Если МассивКонтрагентов.Количество()= 0  Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И РеализацияТоваровУслуг.Контрагент В(&СписокКонтрагентов)","");
		Иначе 
			Запрос.УстановитьПараметр("СписокКонтрагентов", МассивКонтрагентов);
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		ТекДок = Неопределено;
		
		Пока Выборка.Следующий() Цикл 
			
			Если ТекДок <> Выборка.ДокументРН Тогда 
				
				ТекДок = Выборка.ДокументРН;
				Текст.ДобавитьСтроку(
				"1" + 
				"@" + Формат(Выборка.Дата,"ДЛФ=D") + 
				"@" + СокрЛП(Выборка.ДоговорКонтрагентаКод) + 
				"@" + СокрЛП(Выборка.НомерРН) + 
				"@" + СокрЛП(Выборка.ДоговорКонтрагентаНаименование) + 
				"@" + Выборка.НомерСФ + "_" + Прав(Год(Выборка.ДатаСФ),2) + 
				"@" + Выборка.СуммаВключаетНДС + 
				"@" + МСК.ДанныеОКонтрагентеДляСверкиСМосквой(Выборка.Контрагент,1));
				
			КонецЕсли;
			
			Текст.ДобавитьСтроку(
			"9" + 
			"@" + СокрЛП(Выборка.НоменклатураКодПоБазеМоскоречье) + 
			"@" + СтрЗаменить(СокрЛП(Выборка.СерияНоменклатурыНаименование),Символы.ПС,"") + 
			"@" + СокрЛП(СтрЗаменить(Выборка.Количество,Символы.НПП,"")) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.Цена,Символы.НПП,"")) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.Сумма,Символы.НПП,"") + 
			"@" + СокрЛП(СтрЗаменить(Выборка.СуммаНДС,Символы.НПП,""))));
			
		КонецЦикла;
		
	КонецЕсли;
	
	
	// Поступления ТиУ  МОСКВОРЕЧЬЕ
	КонтрагентМоскворечье = Неопределено;

	Если ЗначениеЗаполнено(Константы.ОсновнойПоставщик.Получить()) Тогда
		КонтрагентМоскворечье = Константы.ОсновнойПоставщик.Получить();
	КонецЕсли;		
	
	Если ПоступлениеТоваров и КонтрагентМоскворечье <> Неопределено Тогда
		
		Запрос  = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ
		|	ПоступлениеТоваровУслуг.Ссылка КАК Документ,
		|	ПоступлениеТоваровУслуг.Дата,
		|	ПоступлениеТоваровУслуг.ДоговорКонтрагента.Код КАК ДоговорКонтрагентаКод,
		|	ПоступлениеТоваровУслуг.Номер КАК Номер,
		|	ПоступлениеТоваровУслуг.ДоговорКонтрагента.Наименование КАК ДоговорКонтрагентаНаименование,
		|	ПоступлениеТоваровУслуг.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	ПоступлениеТоваровУслуг.Контрагент,
		|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.НомерСтроки, 0) КАК НомерСтроки,
		|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Номенклатура.КодПоБазеМоскоречье, """") КАК НоменклатураКодПоБазеМоскоречье,
		|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.СерияНоменклатуры.Наименование, """") КАК СерияНоменклатурыНаименование,
		|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Количество, 0) КАК Количество,
		|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Цена, 0) КАК Цена,
		|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Сумма, 0) КАК Сумма,
		|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.СуммаНДС, 0) КАК СуммаНДС
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|		ПО ПоступлениеТоваровУслуг.Ссылка = ПоступлениеТоваровУслугТовары.Ссылка
		|ГДЕ
		|	ПоступлениеТоваровУслуг.Дата МЕЖДУ &ДатаН И &ДатаК
		|	И ПоступлениеТоваровУслуг.Проведен
		|	И ПоступлениеТоваровУслуг.Контрагент = &КонтрагентМоскворечье
		|
		|УПОРЯДОЧИТЬ ПО
		|	Документ,
		|	НомерСтроки
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("ДатаН", ДатаН);
		Запрос.УстановитьПараметр("ДатаК", ДатаК);
		Запрос.УстановитьПараметр("КонтрагентМоскворечье", КонтрагентМоскворечье);
		
		Выборка = Запрос.Выполнить().Выбрать();
		ТекДок = Неопределено;
		
		Пока Выборка.Следующий() Цикл 
			
			Если ТекДок <> Выборка.Документ Тогда 
				
				ТекДок = Выборка.Документ;
				
				Текст.ДобавитьСтроку(
				"Ы" + 
				"@" + Формат(Выборка.Дата,"ДЛФ=D") + 
				"@" + СокрЛП(Выборка.ДоговорКонтрагентаКод) + 
				"@" + СокрЛП(Выборка.Номер) + 
				"@" + СокрЛП(Выборка.ДоговорКонтрагентаНаименование) + 
				"@" + Выборка.СуммаВключаетНДС + 
				"@" + МСК.ДанныеОКонтрагентеДляСверкиСМосквой(Выборка.Контрагент, 1));
				
			КонецЕсли;
			
			Если Выборка.НоменклатураКодПоБазеМоскоречье = "" И Выборка.СерияНоменклатурыНаименование = "" Тогда 
				Продолжить;
			КонецЕсли;	
			
			Текст.ДобавитьСтроку(
			"Ъ" + 
			"@" + СокрЛП(Выборка.НоменклатураКодПоБазеМоскоречье) + 
			"@" + СтрЗаменить(СокрЛП(Выборка.СерияНоменклатурыНаименование),Символы.ПС, "") + 
			"@" + СокрЛП(СтрЗаменить(Выборка.Количество,Символы.НПП, "")) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.Цена,Символы.НПП, "")) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.Сумма,Символы.НПП, "") + 
			"@" + СокрЛП(СтрЗаменить(Выборка.СуммаНДС,Символы.НПП, ""))) );
			
		КонецЦикла;
	КонецЕсли;
	
	
	Если ПКО Тогда
		
		Запрос  = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПриходныйКассовыйОрдер.Ссылка КАК Документ,
		|	ПриходныйКассовыйОрдер.Дата,
		|	ПриходныйКассовыйОрдер.ДоговорКонтрагента.Код,
		|	ПриходныйКассовыйОрдер.Номер КАК Номер,
		|	ПриходныйКассовыйОрдер.ДоговорКонтрагента.Наименование,
		|	ПриходныйКассовыйОрдер.Контрагент,
		|	ПриходныйКассовыйОрдер.НомерЧекаКассовогоАппарата,
		|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СуммаПлатежа,
		|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
		|		ПО ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка = ПриходныйКассовыйОрдер.Ссылка
		|ГДЕ
		|	ПриходныйКассовыйОрдер.Дата МЕЖДУ &ДатаН И &ДатаК
		|	И ПриходныйКассовыйОрдер.Проведен
		|	И ПриходныйКассовыйОрдер.Контрагент В(&СписокКонтрагентов)
		|	И ПриходныйКассовыйОрдер.ВидОперации = &ВидОперации
		|
		|УПОРЯДОЧИТЬ ПО
		|	Документ,
		|	НомерСтроки
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("ДатаН", ДатаН);
		Запрос.УстановитьПараметр("ДатаК", ДатаК);
		
		Если МассивКонтрагентов.Количество()= 0  Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПриходныйКассовыйОрдер.Контрагент В(&СписокКонтрагентов)","");
		Иначе 
			Запрос.УстановитьПараметр("СписокКонтрагентов", МассивКонтрагентов);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийПКО.ОплатаПокупателя);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			
			ТекКонтрагент = Неопределено;
			
			Если ТекКонтрагент <> Выборка.Контрагент Тогда 
				
				ТекКонтрагент = Выборка.Контрагент;
				ДанныеОКонтрагенте = МСК.ДанныеОКонтрагентеДляСверкиСМосквой(Выборка.Контрагент, 1);
				
			КонецЕсли;
			
			Текст.ДобавитьСтроку(
			"2" + 
			"@" + СокрЛП(Выборка.Номер) + 
			"@" + СокрЛП(Выборка.ДоговорКонтрагентаКод) + 
			"@" + СокрЛП(Выборка.ДоговорКонтрагентаНаименование) + 
			"@" + Выборка.НомерЧекаКассовогоАппарата + 
			"@" + Формат(Выборка.Дата, "ДЛФ=D") + 
			"@" + СокрЛП(СтрЗаменить(Выборка.СуммаПлатежа, Символы.НПП, "") + 
			"@" + ДанныеОКонтрагенте));
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если РКО Тогда
		
		Запрос  = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ
		|	РасходныйКассовыйОрдер.Ссылка КАК Документ,
		|	РасходныйКассовыйОрдер.Дата,
		|	РасходныйКассовыйОрдер.Номер КАК Номер,
		|	РасходныйКассовыйОрдерРасшифровкаПлатежа.СуммаПлатежа,
		|	РасходныйКассовыйОрдерРасшифровкаПлатежа.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК РасходныйКассовыйОрдерРасшифровкаПлатежа
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
		|		ПО РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка = РасходныйКассовыйОрдер.Ссылка
		|ГДЕ
		|	РасходныйКассовыйОрдер.Дата МЕЖДУ &ДатаН И &ДатаК
		|	И РасходныйКассовыйОрдер.Проведен
		|	И РасходныйКассовыйОрдер.Контрагент В(&СписокКонтрагентов)
		|	И РасходныйКассовыйОрдер.ВидОперации = &ВидОперации
		|
		|УПОРЯДОЧИТЬ ПО
		|	Документ,
		|	НомерСтроки
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("ДатаН", ДатаН);
		Запрос.УстановитьПараметр("ДатаК", ДатаК);
		
		Если МассивКонтрагентов.Количество()= 0  Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И РасходныйКассовыйОрдер.Контрагент В(&СписокКонтрагентов)","");
		Иначе 
			Запрос.УстановитьПараметр("СписокКонтрагентов", МассивКонтрагентов);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанк);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			
			Текст.ДобавитьСтроку(
			"3" + 
			"@" + СокрЛП(Выборка.Номер) + 
			"@" + Формат(Выборка.Дата,"ДЛФ=D") + 
			"@" + СокрЛП(СтрЗаменить(Выборка.СуммаПлатежа, Символы.НПП, ""))); 
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ВозвратыПокупателей Тогда
		
		Запрос  = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ
		|	ВозвратТоваровОтПокупателя.Ссылка КАК Документ,
		|	ВозвратТоваровОтПокупателя.Дата,
		|	ВозвратТоваровОтПокупателя.ДоговорКонтрагента.Код КАК ДоговорКонтрагентаКод,
		|	ВозвратТоваровОтПокупателя.Номер КАК Номер,
		|	ВозвратТоваровОтПокупателя.ДоговорКонтрагента.Наименование,
		|	ВозвратТоваровОтПокупателя.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	СчетФактураПолученныйДокументыОснования.Ссылка КАК ДокументСФВыданный,
		|	ВозвратТоваровОтПокупателя.Контрагент,
		|	СчетФактураПолученныйДокументыОснования.Ссылка.НомерВходящегоДокумента,
		|	СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента
		|ПОМЕСТИТЬ ДокРН
		|ИЗ
		|	Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
		|		ПО (СчетФактураПолученныйДокументыОснования.ДокументОснование = ВозвратТоваровОтПокупателя.Ссылка)
		|ГДЕ
		|	ВозвратТоваровОтПокупателя.Дата МЕЖДУ &ДатаН И &ДатаК
		|	И ВозвратТоваровОтПокупателя.Проведен
		|	И НЕ СчетФактураПолученныйДокументыОснования.Ссылка ЕСТЬ NULL 
		|	И СчетФактураПолученныйДокументыОснования.Ссылка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокРН.Документ КАК Документ,
		|	ДокРН.Дата,
		|	ДокРН.Номер,
		|	ДокРН.Контрагент,
		|	ДокРН.ДоговорКонтрагентаКод,
		|	ДокРН.ДоговорКонтрагентаНаименование,
		|	ДокРН.СуммаВключаетНДС,
		|	ВозвратТоваровОтПокупателяТовары.Номенклатура.КодПоБазеМоскоречье КАК НоменклатураКодПоБазеМоскоречье,
		|	ВозвратТоваровОтПокупателяТовары.СерияНоменклатуры.Наименование КАК СерияНоменклатурыНаименование,
		|	ВозвратТоваровОтПокупателяТовары.Количество,
		|	ВозвратТоваровОтПокупателяТовары.Цена,
		|	ВозвратТоваровОтПокупателяТовары.Сумма,
		|	ВозвратТоваровОтПокупателяТовары.СуммаНДС,
		|	ВозвратТоваровОтПокупателяТовары.НомерСтроки КАК НомерСтроки,
		|	ДокРН.ДокументСФВыданный,
		|	СчетФактураВыданный.Номер КАК НомерСчетФактураВыданный,
		|	ДокРН.НомерВходящегоДокумента,
		|	ДокРН.ДатаВходящегоДокумента,
		|	ВозвратТоваровОтПокупателяТовары.ДокументПартии,
		|	СчетФактураВыданный.Дата КАК ДатаСФВыданный
		|ИЗ
		|	ДокРН КАК ДокРН
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|			ПО ВозвратТоваровОтПокупателяТовары.ДокументПартии = СчетФактураВыданный.ДокументОснование
		|		ПО ДокРН.Документ = ВозвратТоваровОтПокупателяТовары.Ссылка
		|ГДЕ
		|	НЕ СчетФактураВыданный.Ссылка ЕСТЬ NULL 
		|	И СчетФактураВыданный.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Документ,
		|	НомерСтроки
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("ДатаН", ДатаН);
		Запрос.УстановитьПараметр("ДатаК", ДатаК);
		
		Если МассивКонтрагентов.Количество()= 0  Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ВозвратТоваровОтПокупателя.Контрагент В(&СписокКонтрагентов)","");
		Иначе 
			Запрос.УстановитьПараметр("СписокКонтрагентов", МассивКонтрагентов);
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		ТекДок = Неопределено;
		
		Пока Выборка.Следующий() Цикл 
			
			Если ТекДок <> Выборка.Документ Тогда 
				
				ТекДок= Выборка.Документ;
				Текст.ДобавитьСтроку(
				"4" + 
				"@" + СокрЛП(Выборка.Номер) + 
				"@" + Формат(Выборка.Дата, "ДЛФ=D") + 
				"@" + СокрЛП(Выборка.ДоговорКонтрагентаКод) + 
				"@" + СокрЛП(Выборка.ДоговорКонтрагентаНаименование) + 
				"@" + СокрЛП(Выборка.НомерВходящегоДокумента) + 	
				"@" + Выборка.ДатаВходящегоДокумента + 
				"@" + СокрЛП(Выборка.НомерСчетФактураВыданный + "_" + Прав(Год(Выборка.ДатаСФВыданный), 2)) + 
				"@" + Выборка.СуммаВключаетНДС + 
				"@" + МСК.ДанныеОКонтрагентеДляСверкиСМосквой(Выборка.Контрагент, 1));
				
			КонецЕсли;
			
			Текст.ДобавитьСтроку(
			"8" + 
			"@" + СокрЛП(Выборка.НоменклатураКодПоБазеМоскоречье) + 
			"@" + СокрЛП(Выборка.СерияНоменклатурыНаименование) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.Количество, Символы.НПП, "")) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.Цена, Символы.НПП, "")) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.Сумма, Символы.НПП, "") + 
			"@" + СокрЛП(СтрЗаменить(Выборка.СуммаНДС, Символы.НПП, ""))) );
			
		КонецЦикла;
		
	КонецЕсли;
	
	
	//  ИНВЕНТАРИЗАЦИЯ
	Если Инвентаризация Тогда
		
		Запрос  = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ
		|	ИнвентаризацияТоваровНаСкладе.Ссылка КАК Документ,
		|	ИнвентаризацияТоваровНаСкладе.Дата,
		|	ИнвентаризацияТоваровНаСкладе.Номер КАК Номер,
		|	ИнвентаризацияТоваровНаСкладеТовары.Номенклатура.КодПоБазеМоскоречье,
		|	ИнвентаризацияТоваровНаСкладеТовары.Количество,
		|	ИнвентаризацияТоваровНаСкладеТовары.Цена,
		|	ИнвентаризацияТоваровНаСкладеТовары.КоличествоУчет
		|ИЗ
		|	Документ.ИнвентаризацияТоваровНаСкладе.Товары КАК ИнвентаризацияТоваровНаСкладеТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИнвентаризацияТоваровНаСкладе КАК ИнвентаризацияТоваровНаСкладе
		|		ПО ИнвентаризацияТоваровНаСкладеТовары.Ссылка = ИнвентаризацияТоваровНаСкладе.Ссылка
		|ГДЕ
		|	ИнвентаризацияТоваровНаСкладе.Дата МЕЖДУ &ДатаН И &ДатаК
		|	И НЕ ИнвентаризацияТоваровНаСкладе.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Документ,
		|	ИнвентаризацияТоваровНаСкладеТовары.НомерСтроки
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("ДатаН", ДатаН);
		Запрос.УстановитьПараметр("ДатаК", ДатаК);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			
			Текст.ДобавитьСтроку(
			"5" + 
			"@" + Формат(Выборка.Дата, "ДЛФ=D") + 
			"@" + СокрЛП(Выборка.НоменклатураКодПоБазеМоскоречье) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.Количество, Символы.НПП, "") + 
			"@" + СокрЛП(СтрЗаменить(Выборка.Цена, Символы.НПП, "")) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.КоличествоУчет, Символы.НПП, ""))));
			
		КонецЦикла;
		
	КонецЕсли;
	
	
	//  Корректировка   реализации  
	Если КорректировкаРеализации Тогда
		
		Запрос  = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ
		|	КорректировкаРеализации.Ссылка КАК Документ,
		|	КорректировкаРеализации.Дата,
		|	КорректировкаРеализации.Номер КАК Номер,
		|	ВЫБОР
		|		КОГДА КорректировкаРеализации.СуммаВключаетНДС
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаВключаетНДС,
		|	СФкКорректировке.Ссылка.Номер КАК НомерСФКорректировки,
		|	СФкКорректировке.Ссылка.Дата КАК ДатаСФКорректировки,
		|	СФкРеализации.Ссылка.Номер КАК НомерСФРеализации,
		|	СФкРеализации.Ссылка.Дата КАК ДатаСФРеализации
		|ПОМЕСТИТЬ ДокКорректировкаРеализации
		|ИЗ
		|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СФкКорректировке
		|		ПО КорректировкаРеализации.Ссылка = СФкКорректировке.ДокументОснование
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СФкРеализации
		|		ПО КорректировкаРеализации.ДокументРеализации = СФкРеализации.ДокументОснование
		|ГДЕ
		|	КорректировкаРеализации.Дата МЕЖДУ &ДатаН И &ДатаК
		|	И КорректировкаРеализации.Проведен
		|	И НЕ СФкКорректировке.Ссылка ЕСТЬ NULL 
		|	И НЕ СФкРеализации.Ссылка ЕСТЬ NULL 
		|	И КорректировкаРеализации.Контрагент В(&СписокКонтрагентов)
		|	И СФкКорректировке.Ссылка.Проведен
		|	И СФкРеализации.Ссылка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументКР.Документ КАК Документ,
		|	ДокументКР.Дата,
		|	ДокументКР.Номер,
		|	ДокументКР.СуммаВключаетНДС,
		|	КорректировкаРеализацииТовары.Номенклатура.КодПоБазеМоскоречье КАК НоменклатураКодПоБазеМоскоречье,
		|	КорректировкаРеализацииТовары.СерияНоменклатуры.Наименование КАК СерияНоменклатурыНаименование,
		|	КорректировкаРеализацииТовары.НомерСтроки КАК НомерСтроки,
		|	КорректировкаРеализацииТовары.Количество,
		|	КорректировкаРеализацииТовары.Цена,
		|	КорректировкаРеализацииТовары.Сумма,
		|	КорректировкаРеализацииТовары.СуммаНДС,
		|	КорректировкаРеализацииТовары.КоличествоДоИзменения,
		|	КорректировкаРеализацииТовары.ЦенаДоИзменения,
		|	КорректировкаРеализацииТовары.СуммаДоИзменения,
		|	КорректировкаРеализацииТовары.СуммаНДСДоИзменения,
		|	ДокументКР.НомерСФКорректировки,
		|	ДокументКР.ДатаСФКорректировки,
		|	ДокументКР.НомерСФРеализации,
		|	ДокументКР.ДатаСФРеализации
		|ИЗ
		|	ДокКорректировкаРеализации КАК ДокументКР
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
		|		ПО ДокументКР.Документ = КорректировкаРеализацииТовары.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Документ,
		|	НомерСтроки
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("ДатаН", ДатаН);
		Запрос.УстановитьПараметр("ДатаК", ДатаК);
		
		Если МассивКонтрагентов.Количество()= 0  Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И КорректировкаРеализации.Контрагент В(&СписокКонтрагентов)","");
		Иначе 
			Запрос.УстановитьПараметр("СписокКонтрагентов", МассивКонтрагентов);
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		ТекДок = Неопределено;
		
		Пока Выборка.Следующий() Цикл 
			
			Если ТекДок <> Выборка.Документ Тогда 
				
				ТекДок = Выборка.Документ;
				
				Текст.ДобавитьСтроку(
				"6" + 
				"@" + Формат(Выборка.Дата, "ДЛФ=D") + 
				"@" + Выборка.СуммаВключаетНДС + 
				"@" + Выборка.НомерСФРеализации + "_" + Прав(Год(Выборка.ДатаСФРеализации), 2) +     
				"@" + Выборка.НомерСФКорректировки); 
				
			КонецЕсли;
			
			Текст.ДобавитьСтроку(
			"А" + 
			"@" + СокрЛП(Выборка.НоменклатураКодПоБазеМоскоречье) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.Количество, Символы.НПП, "")) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.Цена, Символы.НПП, "")) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.Сумма, Символы.НПП, "")) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.СуммаНДС, Символы.НПП, "")) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.КоличествоДоИзменения, Символы.НПП, "")) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.ЦенаДоИзменения, Символы.НПП, "")) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.СуммаДоИзменения, Символы.НПП, "")) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.СуммаНДСДоИзменения, Символы.НПП, "")) );
			
		КонецЦикла;
		
	КонецЕсли;
	
	
	//  Возврат  поставщику         
	Если ВозвратПоставщику Тогда
		
		Запрос  = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ
		|	ВозвратТоваровПоставщику.Ссылка КАК Документ,
		|	ВозвратТоваровПоставщику.Дата КАК Дата,
		|	ВозвратТоваровПоставщику.Номер КАК Номер,
		|	ВозвратТоваровПоставщикуТовары.Номенклатура.КодПоБазеМоскоречье КАК НоменклатураКодПоБазеМоскоречье,
		|	ВозвратТоваровПоставщикуТовары.Количество,
		|	ВозвратТоваровПоставщикуТовары.СерияНоменклатуры.НомерГТД КАК СерияНоменклатурыНомерГТД
		|ИЗ
		|	Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
		|		ПО ВозвратТоваровПоставщикуТовары.Ссылка = ВозвратТоваровПоставщику.Ссылка
		|ГДЕ
		|	ВозвратТоваровПоставщику.Дата МЕЖДУ &ДатаН И &ДатаК
		|	И ВозвратТоваровПоставщику.Проведен
		|	И ВозвратТоваровПоставщику.Контрагент В(&СписокКонтрагентов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Документ,
		|	ВозвратТоваровПоставщикуТовары.НомерСтроки
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("ДатаН", ДатаН);
		Запрос.УстановитьПараметр("ДатаК", ДатаК);
		
		Если МассивКонтрагентов.Количество()= 0  Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ВозвратТоваровПоставщику.Контрагент В(&СписокКонтрагентов)","");
		Иначе 
			Запрос.УстановитьПараметр("СписокКонтрагентов", МассивКонтрагентов);
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		ТекДок = Неопределено;
		
		Пока Выборка.Следующий() Цикл 
			
			Если ТекДок <> Выборка.Документ Тогда 
				
				ТекДок = Выборка.Документ;
				
				Текст.ДобавитьСтроку(
				"7" + 
				"@" + СокрЛП(Выборка.Номер) + 
				"@" + Формат(Выборка.Дата, "ДЛФ=D"));
				
			КонецЕсли;
			
			Текст.ДобавитьСтроку(
			"Б" + 
			"@" + СокрЛП(Выборка.НоменклатураКодПоБазеМоскоречье) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.Количество, Символы.НПП, "")) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.СерияНоменклатурыНомерГТД, Символы.НПП, "")));
			
		КонецЦикла;
		
	КонецЕсли;
	
	
	// СПИСАНИЕ ТОВАРОВ
	Если Списание Тогда
		
		Запрос  = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ
		|	СписаниеТоваров.Ссылка КАК Документ,
		|	СписаниеТоваров.Дата,
		|	СписаниеТоваров.Номер КАК Номер,
		|	СписаниеТоваровТовары.Номенклатура.КодПоБазеМоскоречье,
		|	СписаниеТоваровТовары.Количество,
		|	СписаниеТоваровТовары.Цена,
		|	СписаниеТоваровТовары.СерияНоменклатуры.НомерГТД,
		|	СписаниеТоваровТовары.Сумма
		|ИЗ
		|	Документ.СписаниеТоваров.Товары КАК СписаниеТоваровТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеТоваров КАК СписаниеТоваров
		|		ПО СписаниеТоваровТовары.Ссылка = СписаниеТоваров.Ссылка
		|ГДЕ
		|	СписаниеТоваров.Дата МЕЖДУ &ДатаН И &ДатаК
		|	И СписаниеТоваров.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Документ,
		|	СписаниеТоваровТовары.НомерСтроки
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("ДатаН", ДатаН);
		Запрос.УстановитьПараметр("ДатаК", ДатаК);
		
		Выборка = Запрос.Выполнить().Выбрать();
		ТекДок = Неопределено;
		
		Пока Выборка.Следующий() Цикл 
			
			Если ТекДок <> Выборка.Документ Тогда 
				
				ТекДок = Выборка.Документ;
				
				Текст.ДобавитьСтроку(
				"С" + 
				"@" + СокрЛП(Выборка.Номер) + 
				"@" + Формат(Выборка.Дата,"ДЛФ=D"));
				
			КонецЕсли;
			
			Текст.ДобавитьСтроку(
			"Т" + 
			"@" + СокрЛП(Выборка.НоменклатураКодПоБазеМоскоречье) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.Количество, Символы.НПП, "")) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.СерияНоменклатурыНомерГТД, Символы.НПП, "")) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.Цена, Символы.НПП, "")) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.Сумма, Символы.НПП, "")));
			
		КонецЦикла;
		
	КонецЕсли;
	
	// ОПРИХОДОВАНИЕ ТОВАРОВ
	Если Оприходование Тогда
		
		Запрос  = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ
		|	ОприходованиеТоваров.Ссылка КАК Документ,
		|	ОприходованиеТоваров.Дата,
		|	ОприходованиеТоваров.Номер КАК Номер,
		|	ОприходованиеТоваровТовары.Номенклатура.КодПоБазеМоскоречье,
		|	ОприходованиеТоваровТовары.Количество,
		|	ОприходованиеТоваровТовары.Цена,
		|	ОприходованиеТоваровТовары.СерияНоменклатуры.НомерГТД,
		|	ОприходованиеТоваровТовары.СуммаРегл,
		|	ОприходованиеТоваровТовары.Сумма
		|ИЗ
		|	Документ.ОприходованиеТоваров.Товары КАК ОприходованиеТоваровТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОприходованиеТоваров КАК ОприходованиеТоваров
		|		ПО ОприходованиеТоваровТовары.Ссылка = ОприходованиеТоваров.Ссылка
		|ГДЕ
		|	ОприходованиеТоваров.Дата МЕЖДУ &ДатаН И &ДатаК
		|	И ОприходованиеТоваров.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Документ,
		|	ОприходованиеТоваровТовары.НомерСтроки
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("ДатаН", ДатаН);
		Запрос.УстановитьПараметр("ДатаК", ДатаК);
		
		Выборка = Запрос.Выполнить().Выбрать();
		ТекДок = Неопределено;
		
		Пока Выборка.Следующий() Цикл 
			
			Если ТекДок <> Выборка.Документ Тогда 
				
				ТекДок = Выборка.Документ;
				
				Текст.ДобавитьСтроку(
				"Щ" + 
				"@" + СокрЛП(Выборка.Номер) + 
				"@" + Формат(Выборка.Дата, "ДЛФ=D"));
				
			КонецЕсли;
			
			Текст.ДобавитьСтроку(
			"У" + 
			"@" + СокрЛП(Выборка.НоменклатураКодПоБазеМоскоречье) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.Количество, Символы.НПП, "")) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.СерияНоменклатурыНомерГТД, Символы.НПП, "")) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.Цена, Символы.НПП, "")) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.Сумма, Символы.НПП, "")) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.СуммаРегл, Символы.НПП, ""))
			);	
			
		КонецЦикла;
	КонецЕсли;
	
	// ПЕРЕСОРТИЦА
	Если ПересортицаТоваров Тогда
		
		Запрос  = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ
		|	ПересортицаТоваров.Ссылка КАК Документ,
		|	ПересортицаТоваров.Дата,
		|	ПересортицаТоваров.Номер КАК Номер,
		|	ПересортицаТоваров.Организация.Код,
		|	ПересортицаТоваров.Комментарий,
		|	ПересортицаТоваровТовары.Номенклатура.КодПоБазеМоскоречье КАК НоменклатураКодПоБазеМоскоречье,
		|	ПересортицаТоваровТовары.СерияНоменклатуры.НомерГТД КАК СерияНоменклатурыНомерГТД,
		|	ПересортицаТоваровТовары.НоменклатураОприходование.КодПоБазеМоскоречье КАК НоменклатураОприходованиеКодПоБазеМоскоречье,
		|	ПересортицаТоваровТовары.СерияОприходование.НомерГТД КАК СерияОприходованиеНомерГТД,
		|	ПересортицаТоваровТовары.Цена,
		|	ПересортицаТоваровТовары.Количество
		|ИЗ
		|	Документ.ПересортицаТоваров.Товары КАК ПересортицаТоваровТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПересортицаТоваров КАК ПересортицаТоваров
		|		ПО ПересортицаТоваровТовары.Ссылка = ПересортицаТоваров.Ссылка
		|ГДЕ
		|	ПересортицаТоваров.Дата МЕЖДУ &ДатаН И &ДатаК
		|	И ПересортицаТоваров.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Документ,
		|	ПересортицаТоваровТовары.НомерСтроки
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("ДатаН", ДатаН);
		Запрос.УстановитьПараметр("ДатаК", ДатаК);
		
		Выборка = Запрос.Выполнить().Выбрать();
		ТекДок = Неопределено;
		
		Пока Выборка.Следующий() Цикл 
			
			Если ТекДок <> Выборка.Документ Тогда 
				
				ТекДок = Выборка.Документ;
				
				Текст.ДобавитьСтроку(
				"П" + 
				"@" + СокрЛП(Выборка.Номер) + 
				"@" + Формат(Выборка.Дата, "ДЛФ=D"));
				
			КонецЕсли;
			
			Текст.ДобавитьСтроку(
			"Р" + 
			"@" + СокрЛП(Выборка.НоменклатураКодПоБазеМоскоречье) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.СерияНоменклатурыНомерГТД, Символы.НПП, "")) + 
			"@" + СокрЛП(Выборка.НоменклатураОприходованиеКодПоБазеМоскоречье) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.СерияОприходованиеНомерГТД, Символы.НПП, "")) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.Цена, Символы.НПП, "")) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.Количество, Символы.НПП, ""))
			);	
			
		КонецЦикла;
		
	КонецЕсли;
	
	
	//АвансовыйОтчет
	Если АвансовыйОтчет Тогда
		
		Запрос  = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ
		                |	АвансовыйОтчет.Ссылка КАК Документ,
		                |	АвансовыйОтчет.Дата,
		                |	АвансовыйОтчет.Номер КАК Номер,
		                |	АвансовыйОтчет.Комментарий,
		                |	АвансовыйОтчет.СуммаВключаетНДС,
		                |	АвансовыйОтчет.СуммаДокумента,
		                |	АвансовыйОтчет.ФизЛицо,
		                |	АвансовыйОтчет.ВалютаДокумента.Код,
		                |	АвансовыйОтчет.КурсДокумента,
		                |	АвансовыйОтчет.КратностьДокумента,
		                |	АвансовыйОтчет.УчитыватьНДС,
		                |	АвансовыйОтчет.НДСВключенВСтоимость,
		                |	АвансовыйОтчет.НазначениеАванса,
		                |	АвансовыйОтчетВыданныеАвансы.ДокументАванса,
		                |	АвансовыйОтчетВыданныеАвансы.Сумма,
		                |	АвансовыйОтчет.ФизЛицо.Наименование КАК ФизЛицоНаименование
		                |ИЗ
		                |	Документ.АвансовыйОтчет КАК АвансовыйОтчет
		                |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АвансовыйОтчет.ВыданныеАвансы КАК АвансовыйОтчетВыданныеАвансы
		                |		ПО (АвансовыйОтчетВыданныеАвансы.Ссылка = АвансовыйОтчет.Ссылка)
		                |ГДЕ
		                |	АвансовыйОтчет.Дата МЕЖДУ &ДатаН И &ДатаК
		                |	И АвансовыйОтчет.Проведен
		                |
		                |УПОРЯДОЧИТЬ ПО
		                |	Документ,
		                |	АвансовыйОтчетВыданныеАвансы.НомерСтроки
		                |АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("ДатаН", ДатаН);
		Запрос.УстановитьПараметр("ДатаК", ДатаК);
		
		Выборка = Запрос.Выполнить().Выбрать();
		ТекДок = Неопределено;
		
		Пока Выборка.Следующий() Цикл 
			
			Если ТекДок <> Выборка.Документ Тогда 
				
				ТекДок = Выборка.Документ;
				
				Текст.ДобавитьСтроку(
				"В" + 
				"@" + СокрЛП(Выборка.Номер) + 
				"@" + Формат(Выборка.Дата, "ДЛФ=D") + 
				"@" + СокрЛП(Выборка.Комментарий) + 
				"@" + Выборка.СуммаВключаетНДС + 
				"@" + Выборка.ВалютаДокументаКод + 
				"@" + Выборка.КурсДокумента + 
				"@" + Выборка.КратностьДокумента + 
				"@" + Выборка.УчитыватьНДС + 
				"@" + Выборка.НДСВключенВСтоимость + 
				"@" + СокрЛП(Выборка.НазначениеАванса) + 
				"@" + СокрЛП(Выборка.ФизЛицоНаименование));
				
				// Прочее
				Для каждого СтрПрочее Из ТекДок.Прочее Цикл
					
					Текст.ДобавитьСтроку(
					"Д" + 
					"@" + СокрЛП(СтрПрочее.ВидДокВходящий) + 
					"@" + Формат(СтрПрочее.ДатаВходящегоДокумента, "ДЛФ=D") + 
					"@" + СокрЛП(СтрПрочее.НомерВходящегоДокумента) + 
					"@" + СокрЛП(СтрПрочее.БланкСтрогойОтчетности) + 
					"@" + Формат(СтрПрочее.ДатаСФ, "ДЛФ=D") + 
					"@" + СокрЛП(СтрПрочее.НомерСФ) + 
					"@" + СокрЛП(СтрПрочее.Номенклатура.КодПоБазеМоскоречье) + 
					"@" + СокрЛП(СтрПрочее.Поставщик.IDАварда) + 
					"@" + СокрЛП(СтрПрочее.Содержание) + 
					"@" + СокрЛП(СтрПрочее.СтавкаНДС) + 
					"@" + СокрЛП(СтрПрочее.СтатьяЗатрат.Наименование) + 
					"@" + СокрЛП(СтрЗаменить(СтрПрочее.Сумма, Символы.НПП, "")) + 
					"@" + СокрЛП(СтрЗаменить(СтрПрочее.СуммаНДС, Символы.НПП, ""))
					);
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если Выборка.ДокументАванса <> NULL Тогда 
				
				Текст.ДобавитьСтроку(
				"Г" + 
				"@" + СокрЛП(Выборка.ДокументАванса.Номер) + 
				"@" + СокрЛП(ТипЗнч(Выборка.ДокументАванса)) + 
				"@" + СокрЛП(СтрЗаменить(Выборка.Сумма, Символы.НПП, "")) 
				);	
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	//ТребованиеНакладная
	Если ТребованиеНакладная Тогда
		
		Запрос  = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ
		|	ТребованиеНакладная.Ссылка КАК Документ,
		|	ТребованиеНакладная.Дата,
		|	ТребованиеНакладная.Номер КАК Номер,
		|	ТребованиеНакладная.Комментарий,
		|	ТребованиеНакладная.НДСвСтоимостиТоваров,
		|	ТребованиеНакладнаяМатериалы.Номенклатура.КодПоБазеМоскоречье КАК НоменклатураКодПоБазеМоскоречье,
		|	ТребованиеНакладнаяМатериалы.СерияНоменклатуры.НомерГТД КАК СерияНоменклатурыНомерГТД,
		|	ТребованиеНакладнаяМатериалы.Количество,
		|	ТребованиеНакладнаяМатериалы.СтатьяЗатрат.Наименование КАК СтатьяЗатратНаименование
		|ИЗ
		|	Документ.ТребованиеНакладная КАК ТребованиеНакладная
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТребованиеНакладная.Материалы КАК ТребованиеНакладнаяМатериалы
		|		ПО ТребованиеНакладнаяМатериалы.Ссылка = ТребованиеНакладная.Ссылка
		|ГДЕ
		|	ТребованиеНакладная.Дата МЕЖДУ &ДатаН И &ДатаК
		|	И ТребованиеНакладная.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Документ,
		|	ТребованиеНакладнаяМатериалы.НомерСтроки
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("ДатаН", ДатаН);
		Запрос.УстановитьПараметр("ДатаК", ДатаК);
		
		Выборка = Запрос.Выполнить().Выбрать();
		ТекДок = Неопределено;
		
		Пока Выборка.Следующий() Цикл 
			
			Если ТекДок <> Выборка.Документ Тогда 
				
				ТекДок = Выборка.Документ;
				
				Текст.ДобавитьСтроку(
				"Е" + 
				"@" + СокрЛП(Выборка.Номер) + 
				"@" + Формат(Выборка.Дата, "ДЛФ=D") + 
				"@" + СокрЛП(Выборка.Комментарий) + 
				"@" + Выборка.НДСвСтоимостиТоваров);
				
			КонецЕсли;
			
			Текст.ДобавитьСтроку(
			"Ж" + 
			"@" + СокрЛП(Выборка.НоменклатураКодПоБазеМоскоречье) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.СерияНоменклатурыНомерГТД, Символы.НПП, "")) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.Количество, Символы.НПП, "")) + 
			"@" + СокрЛП(Выборка.СтатьяЗатратНаименование) 
			);	
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Поступления ТиУ НЕ МОСКВОРЕЧЬЕ
	
	Если ПоступлениеТоваровНеМоскворечье и КонтрагентМоскворечье <> Неопределено Тогда
		
		Запрос  = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ
		|	ПоступлениеТоваровУслуг.Ссылка КАК Документ,
		|	ПоступлениеТоваровУслуг.Дата,
		|	ПоступлениеТоваровУслуг.ДоговорКонтрагента.Код КАК ДоговорКонтрагентаКод,
		|	ПоступлениеТоваровУслуг.Номер КАК Номер,
		|	ПоступлениеТоваровУслуг.ДоговорКонтрагента.Наименование КАК ДоговорКонтрагентаНаименование,
		|	ПоступлениеТоваровУслуг.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	ПоступлениеТоваровУслуг.Контрагент,
		|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.НомерСтроки, 0) КАК НомерСтроки,
		|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Номенклатура.КодПоБазеМоскоречье, """") КАК НоменклатураКодПоБазеМоскоречье,
		|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.СерияНоменклатуры.Наименование, """") КАК СерияНоменклатурыНаименование,
		|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Количество, 0) КАК Количество,
		|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Цена, 0) КАК Цена,
		|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Сумма, 0) КАК Сумма,
		|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.СуммаНДС, 0) КАК СуммаНДС
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|		ПО ПоступлениеТоваровУслуг.Ссылка = ПоступлениеТоваровУслугТовары.Ссылка
		|ГДЕ
		|	ПоступлениеТоваровУслуг.Дата МЕЖДУ &ДатаН И &ДатаК
		|	И ПоступлениеТоваровУслуг.Проведен
		|	И ПоступлениеТоваровУслуг.Контрагент В(&СписокКонтрагентов)
		|	И ПоступлениеТоваровУслуг.Контрагент <> &КонтрагентМоскворечье
		|
		|УПОРЯДОЧИТЬ ПО
		|	Документ,
		|	НомерСтроки
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("ДатаН", ДатаН);
		Запрос.УстановитьПараметр("ДатаК", ДатаК);
		Запрос.УстановитьПараметр("КонтрагентМоскворечье", КонтрагентМоскворечье);
		
		Если МассивКонтрагентов.Количество()= 0  Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПоступлениеТоваровУслуг.Контрагент В(&СписокКонтрагентов)","");
		Иначе 
			Запрос.УстановитьПараметр("СписокКонтрагентов", МассивКонтрагентов);
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		ТекДок = Неопределено;
		
		Пока Выборка.Следующий() Цикл 
			
			Если ТекДок <> Выборка.Документ Тогда 
				
				ТекДок = Выборка.Документ;
				
				Текст.ДобавитьСтроку(
				"Ь" + 
				"@" + Формат(Выборка.Дата, "ДЛФ=D") + 
				"@" + СокрЛП(Выборка.ДоговорКонтрагентаКод) + 
				"@" + СокрЛП(Выборка.Номер) + 
				"@" + СокрЛП(Выборка.ДоговорКонтрагентаНаименование) + 
				"@" + Выборка.СуммаВключаетНДС + 
				"@" + МСК.ДанныеОКонтрагентеДляСверкиСМосквой(Выборка.Контрагент, 1));
				
			КонецЕсли;
			
			Если Выборка.НоменклатураКодПоБазеМоскоречье = "" И  Выборка.СерияНоменклатурыНаименование = "" Тогда 
				Продолжить;
			КонецЕсли;	
			
			Текст.ДобавитьСтроку(
			"Ю" + 
			"@" + СокрЛП(Выборка.НоменклатураКодПоБазеМоскоречье) + 
			"@" + СтрЗаменить(СокрЛП(Выборка.СерияНоменклатурыНаименование), Символы.ПС, "") + 
			"@" + СокрЛП(СтрЗаменить(Выборка.Количество, Символы.НПП, "")) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.Цена, Символы.НПП, "")) + 
			"@" + СокрЛП(СтрЗаменить(Выборка.Сумма, Символы.НПП, "") + 
			"@" + СокрЛП(СтрЗаменить(Выборка.СуммаНДС, Символы.НПП, ""))) );
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипОтправки = "ПоПочте" Тогда
		
		ЗаголовокФайла = "ДокументыЗаПериод_с_" + Формат(НачПериода, "ДЛФ=D") + "_по_" + Формат(КонПериода, "ДЛФ=D") + ".txt";
		Текст.Записать(КаталогВременныхФайлов() + ЗаголовокФайла, КодировкаТекста.ANSI); 
		
		УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлектроннойПочты.Получить();
		
		Если НЕ Константы.НеОтправлятьПочту.Получить() И ЗначениеЗаполнено(УчетнаяЗапись) И Текст.КоличествоСтрок() > 0 Тогда 
			
			Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
			Сообщение = Новый ИнтернетПочтовоеСообщение;
			
			Если Константы.База.Получить() = Перечисления.НазваниеБазы.Самара Тогда 
				Сообщение.Тема = "Документы за  период из Самары";
			ИначеЕсли Константы.База.Получить() = Перечисления.НазваниеБазы.Владимир Тогда
				Сообщение.Тема = "Документы за период из Владимира";
			ИначеЕсли Константы.База.Получить() = Перечисления.НазваниеБазы.Рязань Тогда
				Сообщение.Тема = "Документы за период из Рязани";
			ИначеЕсли Константы.База.Получить() = Перечисления.НазваниеБазы.Тула Тогда
				Сообщение.Тема = "Документы за период из Тулы";
			ИначеЕсли Константы.База.Получить() = Перечисления.НазваниеБазы.Ярославль Тогда
				Сообщение.Тема = "Документы за период из Ярославля";
			КонецЕсли;
			
			МылоКонтрагента = "";
			
			МылоКонтрагента = СокрЛП(АдресПочтыВМоскве);
			Почта = Новый ИнтернетПочта; 
			Почта.Подключиться(Профиль);
			
			Попытка
				Почта.Подключиться(Профиль);
			Исключение
				
				РезультатРаботы ="Не сумел подключиться к почтовому серверу!";
				Возврат РезультатРаботы;
				
			КонецПопытки;
			
			Сообщение.Получатели.Добавить(МылоКонтрагента);   
			Сообщение.Отправитель = УчетнаяЗапись.АдресЭлектроннойПочты;
			Сообщение.Вложения.Добавить(КаталогВременныхФайлов() + ЗаголовокФайла,ТипФайлаТабличногоДокумента.TXT);
			Почта.Послать(Сообщение);
			
			Сообщение.Получатели.Очистить();
			Сообщение.Вложения.Очистить();
			Почта.Отключиться();
			УдалитьФайлы(КаталогВременныхФайлов()+ЗаголовокФайла);
			РезультатРаботы = "Успешно!";
			
		КонецЕсли;
		
	Иначе 
		
		// Обмем через FTP
		ИмяКаталогаФайлаДляМосквы = НастройкаОбмена.ПапкаФайловДляМосквы;
		РезультатРаботы = ВыполнитьОбмен(Текст, НачПериода, КонПериода);
		
	КонецЕсли;
	
	Возврат РезультатРаботы;
	
КонецФункции	

Функция ЗапуститьВыгрузку(НастройкиОтправки) Экспорт
	
	РН 					= НастройкиОтправки.РН;
	ПКО 				= НастройкиОтправки.ПКО;
	РКО 				= НастройкиОтправки.РКО;
	ВозвратыПокупателей = НастройкиОтправки.ВозвратыПокупателей;
	Инвентаризация 		= НастройкиОтправки.Инвентаризация;
	КорректировкаРеализации = НастройкиОтправки.КорректировкаРеализации;
	ВозвратПоставщику 	= НастройкиОтправки.ВозвратПоставщику;
	ПоступлениеТоваров 	= НастройкиОтправки.ПоступлениеТоваров;
	Списание 			= НастройкиОтправки.Списание;
	Оприходование 		= НастройкиОтправки.Оприходование;
	ПересортицаТоваров 	= НастройкиОтправки.ПересортицаТоваров;
	ПоступлениеТоваровНеМоскворечье 	= НастройкиОтправки.ПоступлениеТоваровНеМоскворечье;
	
	НачДата 			= НастройкиОтправки.НачДата;
	КонДата 			= НастройкиОтправки.КонДата;
	НастройкаОбмена 	= НастройкиОтправки.НастройкаОбмена;
	АдресПочтыВМоскве 	= НастройкиОтправки.АдресПочтыВМоскве;
	ТипОтправки			= НастройкиОтправки.ТипОтправки;
	НачПериода			= НастройкиОтправки.НачДата;
	КонПериода			= НастройкиОтправки.КонДата;
	
	ВыполнитьОтправку();
	
	РезультатОтправки = "";
	Возврат РезультатОтправки;
	
КонецФункции
